In [20]:
import pandas as pd
import numpy as np
import matplotlib

In [21]:
a_df = pd.DataFrame({
    'Country': ['Germany', 'France', 'Belgium', 'Finland'],
    'Population (M)': [82.8, 67.2, 11.4, 5.5],
    'Capital': ['Berlin', 'Paris', 'Brussels', 'Helsinki']
})
a_df

   Country  Population (M)   Capital
0  Germany            82.8    Berlin
1   France            67.2     Paris
2  Belgium            11.4  Brussels
3  Finland             5.5  Helsinki

In [22]:
b_df = pd.DataFrame({
    'Country': ['Germany', 'France', 'Belgium', 'Canada'],
    'HDI': [0.936, 0.901, 0.916, 0.926]
})
b_df

   Country    HDI
0  Germany  0.936
1   France  0.901
2  Belgium  0.916
3   Canada  0.926

# Merge function

In [23]:
outer_merge = a_df.merge(b_df, on = 'Country', how = 'outer')
outer_merge

   Country  Population (M)   Capital    HDI
0  Germany            82.8    Berlin  0.936
1   France            67.2     Paris  0.901
2  Belgium            11.4  Brussels  0.916
3  Finland             5.5  Helsinki    NaN
4   Canada             NaN       NaN  0.926

In [26]:
outer_merge.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5 entries, 0 to 4
Data columns (total 4 columns):
Country           5 non-null object
Population (M)    4 non-null float64
Capital           4 non-null object
HDI               4 non-null float64
dtypes: float64(2), object(2)
memory usage: 200.0+ bytes

# Join function

In [33]:
aa_df = a_df.set_index("Country")
aa_df

         Population (M)   Capital
Country
Germany            82.8    Berlin
France             67.2     Paris
Belgium            11.4  Brussels
Finland             5.5  Helsinki

In [29]:
bb_df = b_df.set_index("Country")
bb_df

           HDI
Country
Germany  0.936
France   0.901
Belgium  0.916
Canada   0.926

In [38]:
aa_df.join(bb_df, how = 'outer')

         Population (M)   Capital    HDI
Country
Belgium            11.4  Brussels  0.916
Canada              NaN       NaN  0.926
Finland             5.5  Helsinki    NaN
France             67.2     Paris  0.901
Germany            82.8    Berlin  0.936

In [39]:
concat_df = pd.concat([a_df, b_df], axis="index", sort=False)
concat_df

   Country  Population (M)   Capital    HDI
0  Germany            82.8    Berlin    NaN
1   France            67.2     Paris    NaN
2  Belgium            11.4  Brussels    NaN
3  Finland             5.5  Helsinki    NaN
0  Germany             NaN       NaN  0.936
1   France             NaN       NaN  0.901
2  Belgium             NaN       NaN  0.916
3   Canada             NaN       NaN  0.926

# Olympic Games

In [82]:
countries_df = pd.read_csv('dictionary.csv')
countries_df.head(2)

       Country Code  Population  GDP per Capita
0  Afghanistan  AFG  32526562.0      594.323081
1      Albania  ALB   2889167.0     3945.217582

In [83]:
summer_df = pd.read_csv('summer.csv').rename(columns = {'Country' : 'Code'})
summer_df.head(2)

,Year,City,Sport,Discipline,Athlete,Code,Gender,Event,Medal
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver

In [84]:
winter_df = pd.read_csv('winter.csv').rename(columns = {'Country' : 'Code'})
winter_df.head(2)

,Year,City,Sport,Discipline,Athlete,Code,Gender,Event,Medal
0,1924,Chamonix,Biathlon,Biathlon,"BERTHET, G.",FRA,Men,Military Patrol,Bronze
1,1924,Chamonix,Biathlon,Biathlon,"MANDRILLON, C.",FRA,Men,Military Patrol,Bronze

In [85]:
summer_df['Season'] = 'Summer'
summer_df.head(3)

,Year,City,Sport,Discipline,Athlete,Code,Gender,Event,Medal,Season
0,1896,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold,Summer
1,1896,Athens,Aquatics,Swimming,"HERSCHMANN, Otto",AUT,Men,100M Freestyle,Silver,Summer
2,1896,Athens,Aquatics,Swimming,"DRIVAS, Dimitrios",GRE,Men,100M Freestyle For Sailors,Bronze,Summer

In [86]:
summer_countries_df = summer_df.merge(countries_df, on = 'Code', how = 'outer')
summer_countries_df.head(2)

,Year,City,Sport,Discipline,Athlete,Code,Gender,Event,Medal,Season,Country,Population,GDP per Capita
0,1896.0,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,100M Freestyle,Gold,Summer,Hungary,9844686.0,12363.54346
1,1896.0,Athens,Aquatics,Swimming,"HAJOS, Alfred",HUN,Men,1200M Freestyle,Gold,Summer,Hungary,9844686.0,12363.54346

In [90]:
winter_df['Season'] = 'Winter'
winter_df.head(2)

,Year,City,Sport,Discipline,Athlete,Code,Gender,Event,Medal,Season
0,1924,Chamonix,Biathlon,Biathlon,"BERTHET, G.",FRA,Men,Military Patrol,Bronze,Winter
1,1924,Chamonix,Biathlon,Biathlon,"MANDRILLON, C.",FRA,Men,Military Patrol,Bronze,Winter

In [94]:
winter_countries_df = winter_df.merge(countries_df, on = 'Code', how = 'outer')
winter_countries_df.head(2)

,Year,City,Sport,Discipline,Athlete,Code,Gender,Event,Medal,Season,Country,Population,GDP per Capita
0,1924.0,Chamonix,Biathlon,Biathlon,"BERTHET, G.",FRA,Men,Military Patrol,Bronze,Winter,France,66808385.0,36205.568102
1,1924.0,Chamonix,Biathlon,Biathlon,"MANDRILLON, C.",FRA,Men,Military Patrol,Bronze,Winter,France,66808385.0,36205.568102

In [102]:
all_df = pd.concat([winter_countries_df,summer_countries_df])
all_df.head(2)

,Year,City,Sport,Discipline,Athlete,Code,Gender,Event,Medal,Season,Country,Population,GDP per Capita
0,1924.0,Chamonix,Biathlon,Biathlon,"BERTHET, G.",FRA,Men,Military Patrol,Bronze,Winter,France,66808385.0,36205.568102
1,1924.0,Chamonix,Biathlon,Biathlon,"MANDRILLON, C.",FRA,Men,Military Patrol,Bronze,Winter,France,66808385.0,36205.568102

#### use boolean indexing, grouping & sorting to print a list of the Top 10 countries who won the most medals since 1984

###### 1/ delete before 1984

In [120]:
all84_df = all_df[all_df.Year >= 1984]
all84_df.head()

,Year,City,Sport,Discipline,Athlete,Code,Gender,Event,Medal,Season,Country,Population,GDP per Capita
47,1984.0,Sarajevo,Skiing,Alpine Skiing,"PELEN, Perrine",FRA,Women,Giant Slalom,Bronze,Winter,France,66808385.0,36205.568102
48,1984.0,Sarajevo,Skiing,Alpine Skiing,"BOUVET, Didier",FRA,Men,Slalom,Bronze,Winter,France,66808385.0,36205.568102
49,1984.0,Sarajevo,Skiing,Alpine Skiing,"PELEN, Perrine",FRA,Women,Slalom,Silver,Winter,France,66808385.0,36205.568102
50,1988.0,Calgary,Skiing,Alpine Skiing,"PICCARD, Franck",FRA,Men,Downhill,Bronze,Winter,France,66808385.0,36205.568102
51,1988.0,Calgary,Skiing,Alpine Skiing,"PICCARD, Franck",FRA,Men,Super-G,Gold,Winter,France,66808385.0,36205.568102

In [133]:
all84_df.groupby(['Country','Medal']).count().head(3)

                    Year  City  Sport  Discipline  Athlete  Code  Gender  \
Country     Medal
Afghanistan Bronze     2     2      2           2        2     2       2
Algeria     Bronze     8     8      8           8        8     8       8
            Gold       5     5      5           5        5     5       5

                    Event  Season  Population  GDP per Capita
Country     Medal
Afghanistan Bronze      2       2           2               2
Algeria     Bronze      8       8           8               8
            Gold        5       5           5               5

In [146]:
medals_df = all84_df.groupby('Country').count()[['Medal']]
medals_df

                 Medal
Country
Afghanistan          2
Algeria             15
Argentina          173
Armenia             11
Australia          891
...                ...
Venezuela            7
Vietnam              2
Virgin Islands*      1
Zambia               2
Zimbabwe             7

[123 rows x 1 columns]

In [147]:
medals_df.sort_values(by = 'Medal', ascending = False).head(11)

                Medal
Country
United States    2472
Germany          1112
Russia           1031
Australia         891
China             889
Canada            801
Italy             632
Korea, South      587
France            587
Netherlands       563
United Kingdom    545

In [149]:
season_medals_df = all84_df.groupby(['Country', 'Season']).count()[['Medal']]
season_medals_df

                        Medal
Country         Season
Afghanistan     Summer      2
Algeria         Summer     15
Argentina       Summer    173
Armenia         Summer     11
Australia       Summer    876
...                       ...
Venezuela       Summer      7
Vietnam         Summer      2
Virgin Islands* Summer      1
Zambia          Summer      2
Zimbabwe        Summer      7

[157 rows x 1 columns]